{"comments": ["So glad I found this again", "And so I cry sometimes when I'm lying in bed\r\nJust to get it all out what's in my head\r\nAnd I, I'm feeling a little peculiar\r\nAnd so I wake in the morning and I step outside\r\nAnd I take a deep breath and get real high\r\nAnd I scream from the top of my lungs\r\nWhat's goin' on?\r\nAnd I say hey, yeah, yeah, yeah yay\r\nHey, yay, yay\r\nI said hey, what's goin' on?\r\nAnd I say hey, yeah, yeah, yeah yay\r\nHey, yay, yay\r\nI said hey, what's goin' on?\r\nAnd he tries\r\nOh my God, do I try\r\nI try all the time\r\nIn this institution\r\nAnd he prays\r\nOh my God, do I pray\r\nI pray every single day\r\n(Nyaaah)\r\nFor a revolution\r\nAnd I say hey, yeah, yeah, yeah yay\r\nHey, yay, yay\r\nI said hey, what's goin' on?\r\nAnd I say hey, yeah, yeah, yeah yay (Don't cry out loud)\r\nHey, yay, yay\r\nI said hey (Just keep it inside)\r\n(And learn how to hide your feelings)\r\nHey, yeah, yeah, yeah yay\r\nHey, yay\r\nHey hey hey\r\nI say hey\r\nWhat's goin' on?\r\nYeah!", "He finally is a teenager.... Oh great😑", "1:38 remember this part from back in the day. Friend was showing class on a laptop; my older sister had always liked this song and so I actually was familiar with it, and it struck me as so absurd to toss in here that I burst out laughing when I recognized it. Confused looks lol", "It's great MAD. GOD Lv", "Never knew, this video exists", "Voltem para o Egito.", "Girls please use less clothes", "Im not prostitute", "Go many of you tô the Copacabana beach", "Put lengend on the movies and take off the translate in Brasil .", "Heyyyyyyyeaa", "Heyyyyyyyyyyyyyyyyyyyyyyyea", "Heyyeeaaa", "Heyyeeaa", "HEYYEEYYAAAA", "HEYYEYYAA", "HEYYEYAA", "HEMAN HEYYEYAA", "Heyyeeyaeyeya", "Heyyeaaa", "Heyyetyaeyeya", "HEYYYEEAA", "HEEYYEEAA", "HEEYYEEYAA", "Wow fuck I'm getting out of this video.", "Hahahaha", "when you're a singer but your mom told you to do art", "The honor of being here when this video first came out. 🖤🖤🖤", "Why does Robyn dance like this", "Heyheyheyheyhey", "This song is so gay. Almost as good as gangnam style, lmao. the kitchen scene is the best, you know there's some he-man karaoke going on behind the doors, lol, with all the disco lights and sh-t", "Clásico", "literally my dreams", "AND HE PRAYS", "Core memory", "whats goin ON AND HE TRTIES OH MY GOD DOD IO TRY\ni try all the time\n\n\nand this tinsitution\n\nAND HE PRAYS", "I found this through a chat site in like 2010 and it’s never left my mind", "MYAAAAAAAAAA", "Idk im doing here", "Someone: Makes a comment about how they like the video\nReplies: S T O L E N", "SOMEDAY IN THE DISTANT FUTURE THERE WILL BE AN ENTIRE RELIGION BASED ON THIS VIDEO.\nOMMMMMMMMMMMmmmm...", "You stole this video", "This video marked a before and after on the internet.", "Got this in my recommended again on the day it turns 13\nTime flies…", "I can't believe that today this video is already 13 years old, and the best thing is that it has aged well", "If you're here and enjoying this then great! It's a classic. BUT know that the original creator of this is the channel slackcircus. This is basically an edited stolen copy... It's a long story. Also this channel is abandoned already so no use defending it. Let the truth be known for the sake of truth!!!", "Tomorrow is the birthday of this masterpiece.", "This song was in the tmnt movie recently and when I recognized it i started cheering😂😂😂😂😂😂😂😂", "credit @slackcircus", "And that's how pride started-", "They didn't actually sing this in the show right 😭", "HEEEEYEEEEYEEEYEYEHEYEEEYEEEE", "Still fuuuuny", "イエイ!!", "Looks like California, but it’s the Netherlands.", "bum", "รักแม่ไนท์", "The global anthem of the internet.", "Sai daqui do meu celular.. nao quero propaganda de voces no meu celular. Xo", "Conhece regime cerebral...  é o que um monte de gente vai ter daqui em diante... Emagrecimento de cerebro...", "OMG BRO I REMEMBER WATCHING THIS WHEN I WAS SO YOUNG", "Nao tenho que comer drogas criadas por uma instituição de morte dizendo que é um sistema de saude falso pra satisfazer a vontade de demônios nojentos do inferno que continuam querendo cometer crimes contra minha vida de calunia, perjuria e difaçao pra me roubar de novo. Vao pro inferno diabos. Comam vocês as drogas que voces produzem . Eu nao preciso...  demonios. Voces é que precisam que eu use pra validarem sua existência nesse mundo mesmo que eu nunca tivesse precisado de vocês pra porra nenhuma. Pede pro Peter James Simpson usar suas drogas psiquiatricas ao inves de voces so transarem e dar suas buecetas pra ele usar.. demônios", "Saiam da minha vida voces que usam psiquiatria pra me perseguir e tentar me assassinar... Saiam da minha vida demonios. Isso é pra quem tem que ler isso e nao desiste de cometer crimes de assedio moral e outros contra minha vida. Vao embora", "Eu nao sou escrava ou propriedade de outras pessoas.... Eu nao to sh.... Para de usar futebol pra me colocar terror e medo via locuções e usando outras pessoas. Isso é pra quem precisa ler isso que nao quer sair da minha vida nem por um caralho e fica me perseguindo em todos os lugares do mundo. Xo", "What ya doin’ he-man", "I wish I showed this to my dad before he past. He loved he man. Showing him this video of he man being feminine would have either pissed him off or given him the biggest laugh because of how comically homophobic he was.", "Yeah I know about He-Man\n\n*This plays in my head*", "thus bring me back so 10 yers ago", "Haah. The good old days...", "I will leave this comment here so when someone replys or likes i will be notified of this masterpiece", "I never heard of this song when I was in the 2013 in 10 years later", "Like experiencing the rapture. Like weeping profusely as you witness the face of God.", "理解しなくてもいい動画なのか？", "I miss watching old stuff like this", "gay", "I like that this is a song originally sung by a woman but the most popular and easily the best version is a man with an effeminate tone singing it over Prince Adam clips with minimal editing.", "0p0😊😊😊😊", "0:16", "Anyone else just remembered this existed", "https://www.youtube.com/watch?v=6NXnxTNIWkc", "BİTMİYOR YARDIM EDİN", "This is the only reason why i like the internet.", "I feel like I just wandered into a time machine wow", "This is about one day someone tried to eat my ass in the bed like a phanton and i though was you.... So i sleap and tried to eat your ass in payback. All in ghosts mode", "1:11\n1:19\nEpic", "ЧЗХ. ЧЁ ЭТО??!!!", "Im sad for the people who havent seen the full video on slackcirucs' channel", "lol", "What’s the show name?", "Я ТАК ЖЕ УМЕЮ", "quoicoubeh", "💔💔💔", "Life was good when this banger dropped", "Bro i always come back to this GOLDEN MASTERPIECE", "I remember watching this, it was so long ago. I miss old YouTube", "I'm back for this", "I want know what this expressions of arrive there means?", "And them hers screams laudly on jornals in desperations", "You standing and suporting hers and theys doing the tchi tchi tchi voices?", "Yes im very agressive sometimes .   I will not be theirs diabolic projects", "You just are forcing astral sex on me by your psiquiatrics drugs and your vanishes and others drugs all globo telis are doing this all the time and others and doing the same productions to others to make pars ..  this will not happen", "A A N D HE PRAYS\nholy shit that gave me a good laugh in 2023", "Eu só penso em Jojo", "a classic", "My comfort song ngl", "I will not hide my feelings never more", "The fact that I had to watch a 15 seconds ad to witness this masterpiece is a violation against human rights", "ешё при детях такое вабше кринж", "Кто думает что она больная на голову сюда👇", "ㄱ", "I watched it first in 2021. It was great to watch.", "thank you.", "This is a gem.", "I quite enjoyed this :)", "I miss the good old days of youtube."]}